bench/results/server1/2/scotty-0.8.2/AFTER_DEEP.log
Benchmarking AFTER_DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.52ms    8.25ms  77.42ms   52.16%
    Req/Sec     8.87k     2.60k   12.82k    49.23%
  513285 requests in 30.00s, 72.94MB read
Requests/sec:  17109.69
Transfer/sec:      2.43MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.63ms   10.75ms  61.12ms   86.77%
    Req/Sec     8.82k     0.92k   10.53k    62.31%
  518550 requests in 30.00s, 73.68MB read
Requests/sec:  17285.28
Transfer/sec:      2.46MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.75ms    7.58ms 154.47ms   47.47%
    Req/Sec     8.75k     2.60k   13.61k    45.75%
  513406 requests in 30.00s, 72.95MB read
Requests/sec:  17113.89
Transfer/sec:      2.43MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.87ms    6.06ms  49.20ms   72.33%
    Req/Sec     8.68k     0.94k   10.85k    63.90%
  512299 requests in 30.00s, 72.80MB read
Requests/sec:  17076.71
Transfer/sec:      2.43MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.98ms    6.78ms  59.53ms   56.71%
    Req/Sec     8.72k     1.55k   11.30k    54.31%
  512594 requests in 30.00s, 72.84MB read
Requests/sec:  17086.52
Transfer/sec:      2.43MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.65ms    5.20ms 250.35ms   87.05%
    Req/Sec     8.70k   559.87    10.44k    75.38%
  511784 requests in 30.00s, 72.72MB read
Requests/sec:  17059.56
Transfer/sec:      2.42MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.95ms    5.09ms  49.18ms   64.26%
    Req/Sec     8.72k     1.37k   11.70k    58.87%
  513023 requests in 30.00s, 72.90MB read
Requests/sec:  17100.76
Transfer/sec:      2.43MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.92ms    4.97ms  48.63ms   77.67%
    Req/Sec     8.65k     1.04k   10.87k    66.40%
  510212 requests in 30.00s, 72.50MB read
Requests/sec:  17007.27
Transfer/sec:      2.42MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.76ms    7.54ms  57.51ms   83.21%
    Req/Sec     8.66k   809.91    10.28k    67.52%
  511840 requests in 30.00s, 72.73MB read
Requests/sec:  17061.32
Transfer/sec:      2.42MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.38ms    4.41ms 214.02ms   58.25%
    Req/Sec     8.64k     2.01k   12.50k    59.02%
  508349 requests in 30.00s, 72.24MB read
Requests/sec:  16945.12
Transfer/sec:      2.41MB
=================== summary ===================
ghc version:  7.8.2
bench target: scotty-0.8.2
bench:        AFTER_DEEP
bench mode:   30s * 10
average:      17084.61
stdev:        87.36
=================== oneline ===================
7.8.2,scotty-0.8.2,AFTER_DEEP,30s,10,17084.61,87.36