bench/results/server1/2/scotty-0.8.2/DEEP.log
Benchmarking DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.46ms   23.49ms 831.59ms   94.79%
    Req/Sec     2.46k   439.79     3.21k    52.31%
  142461 requests in 30.01s, 20.11MB read
Requests/sec:   4747.61
Transfer/sec:    686.18KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.01ms   27.04ms 817.40ms   95.38%
    Req/Sec     2.38k   126.98     2.72k    78.55%
  142030 requests in 30.00s, 20.05MB read
Requests/sec:   4734.15
Transfer/sec:    684.23KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.28ms   43.28ms 910.40ms   94.50%
    Req/Sec     2.52k   649.32     3.46k    53.42%
  142813 requests in 30.00s, 20.16MB read
Requests/sec:   4760.28
Transfer/sec:    688.01KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.34ms   44.37ms   1.12s    93.55%
    Req/Sec     2.38k   142.14     2.65k    92.04%
  141560 requests in 30.00s, 19.98MB read
Requests/sec:   4718.64
Transfer/sec:    681.99KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.94ms   34.29ms 956.84ms   90.97%
    Req/Sec     2.44k   671.32     3.31k    61.69%
  139160 requests in 30.00s, 19.64MB read
Requests/sec:   4638.60
Transfer/sec:    670.42KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.85ms   47.95ms   1.41s    94.03%
    Req/Sec     2.42k   601.33     3.25k    52.73%
  142922 requests in 30.00s, 20.17MB read
Requests/sec:   4764.02
Transfer/sec:    688.55KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.19ms   39.32ms 225.31ms   65.36%
    Req/Sec     3.47k   527.94     4.78k    91.72%
  142763 requests in 30.01s, 20.15MB read
Requests/sec:   4757.60
Transfer/sec:    687.62KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    50.26ms   47.27ms   1.28s    59.68%
    Req/Sec     2.59k     1.15k    3.80k    57.83%
  142420 requests in 30.00s, 20.10MB read
Requests/sec:   4748.10
Transfer/sec:    686.25KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.73ms   31.45ms 797.65ms   94.73%
    Req/Sec     2.33k   219.07     2.78k    60.63%
  142362 requests in 30.00s, 20.09MB read
Requests/sec:   4745.44
Transfer/sec:    685.86KB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.08ms   41.81ms   1.06s    95.64%
    Req/Sec     2.41k   104.32     2.65k    69.52%
  142810 requests in 30.00s, 20.16MB read
Requests/sec:   4760.29
Transfer/sec:    688.01KB
=================== summary ===================
ghc version:  7.8.2
bench target: scotty-0.8.2
bench:        DEEP
bench mode:   30s * 10
average:      4737.47
stdev:        37.37
=================== oneline ===================
7.8.2,scotty-0.8.2,DEEP,30s,10,4737.47,37.37